////Это файл redux actions. Экспортируеются константы, которые представляют различные типы действий, а также функции экшенов, которые возвращают объект действия с заданными параметрами.
export const ADD_MESSAGE = "ADD_MESSAGE"; // используется для добавления нового сообщения в существующий массив сообщений в состоянии
export const SET_MESSAGES = "SET_MESSAGES"; // используется для установки всего массива сообщений в состоянии
export const MESSAGE_TYPING = "MESSAGE_TYPING";
export const SET_CURRENTUSER = "SET_CURRENTUSER"; // используется для установки текущего пользователя. В данном файле не записан экшен, так как он происходит в файле Login.jsx

 